{
  "mptMainTitle": "L2MP Staking",
  "mptMainDesc": "The Level 2 EVM network built on top of the Waves blockchain marks the initial phase of the Waves 2.0 vision. This network facilitates the interaction of various chains through a streamlined beacon-chain, designed specifically for efficient zero-knowledge proof verification. It focuses on supporting basic transactions, including transfers and native token staking, while utilizing the same cost-effective consensus mechanism across all participating L2s. Furthermore, it enables seamless interchain transfers among these networks.",
  "mptMainDesc1": "Unlike other approaches, our optimization strategy involves enhancing the L1 layer for L2 interactions. Rather than optimizing L2 to align with a particular L1, we introduce a Layer Zero, or L0 network. The primary purpose of this network is to serve as the foundational layer, delivering consensus and facilitating interchain interaction capabilities for multiple interconnected chains.",
  "mptMainDesc2": "The initial phase towards establishing a comprehensive network involves launching an L2 network that interacts with the existing Waves blockchain while supporting the Ethereum Virtual Machine (EVM). The concepts employed in this network will be expanded to other L2 chains, including L2-L1 interaction and L2 consensus through re-staking, which utilizes validators' stake locked on L1.",
  "mptMainDesc3": "To realize the envisioned architecture, we need to enhance the Waves layer with provable finality, ensuring transactions cannot be reversed after a specific number of blocks. Additionally, we will implement a 'fractal consensus' model where L2 consensus essentially mirrors the consensus mechanism of L1. In this approach, L2 consensus relies on stake locked on L1. To achieve this, we separate the consensus layer from the processing layer, allowing L2 to solely focus on processing tasks while delegating consensus responsibilities to L1.",
  "mptMainDesc4": "To establish the network, an intermediary token called Mining Power Token (L2MP) is introduced. L2MP allows users to secure a portion of the future supply of the L2 native token. The L2 native token serves as the fee asset on L2, with transaction fees paid in this token. Additionally, it plays a role in the L2 DAO. Initially, the L2 native token will have zero supply, creating scarcity during the system's early launch phase.",
  "mptMainDesc5": "All L2 tokens (Unit0) will be exclusively mined by L2MP token holders within a two-year timeframe. After this initial mining period, Waves balances will transition to function as validators for the L2 network.",
  "mptMainDesc6": "During the initial bootstrapping phase of the EVM L2, only L2MP token holders will have the opportunity to mine L2 tokens. In this phase, the entire 10 million token supply will be distributed solely based on L2MP token holdings over the course of two years from the token's launch.",
  "mptMainDesc7": "The total supply of L2MP tokens is 1 billion. The maximum possible quantity of these tokens will be distributed to XTN holders at a 1:1 exchange rate. The remaining tokens are reserved for the L2 network DAO, public airdrop, and pre-seed investors, with the funds raised allocated for liquidity provision.",
  "mptMainDesc8": "You can swap XTN to L2MP and stake them [here](https://waves-dapp.com/3PANnmCGrufT8SZY5u6BZUgZq4QTh5XdPMa).",
  "mptMainDesc9": "The smart contract source code, as well as any updates and additions, are stored in [public repositories](https://waves-dapp.com/3PANnmCGrufT8SZY5u6BZUgZq4QTh5XdPMa).",
  "mptConnectToLogIn": "Connect Wallet to Log In",
  "enterAmount": "Enter amount",
  "stake": "Stake",
  "unstake": "Unstake",
  "availableForStaking": "Available for Staking",
  "availableForUnstaking": "Available for Unstaking",
  "estimatedAnnualInterest": "Estimated Annual Interest",
  "estimatedAnnualInterestHelp": "Estimated Annual Interest calculated as ratio of total profit to total amount in staking.",
  "error": {
    "min": "Min amount is {{amount}} {{assetName}}.",
    "unsufficient": "Insufficient funds.",
    "required": "This field is required.",
    "invalidAddress": "The address is not valid."
  },
  "transactionFee": "Transaction Fee",
  "transactionFeeTooltip": "A transaction fee is a fee that an account owner pays to send a transaction in the Waves blockchain.",
  "logout": "Log Out",
  "continue": "Continue",
  "legalCheckbox": "I have read and agreed with the {span.legalDisclaimer}[Legal Disclaimer].",
  "keeperWallet": "Keeper Wallet",
  "seed": "WX Network Seed",
  "cloud": "WX Network Email",
  "metaMask": "MetaMask",
  "ledger": "Ledger",
  "signCustomData": {
    "title": "Sign Custom Data",
    "desc": "Sign custom data on your {{device}} to continue."
  },
  "switchNetwork": {
    "title": "Switch to {{network}} Network",
    "desc": "To continue using our services please switch to {{network}} network on your {{device}}."
  },
  "connectionRejected": {
    "title": "Connection Rejected",
    "desc": "You have rejected connection to {{device}}."
  },
  "noAccountsKeeperWallet": {
    "title": "No Accounts on {{device}}",
    "desc": "Unfortunately, we were unable to find any accounts on your {{device}}. Please import existing accounts or create a new account on your {{device}} and retry."
  },
  "accountOrCreateNew": {
    "title": "Log In to Account or Create New Account",
    "desc": "To continue using our services please log in to existing or create a new account on your {{device}}."
  },
  "connectionFailed": {
    "title": "Connection Failed",
    "descMetaMask": "Unfortunately, we were unable to find the MetaMask extension installed on this browser. Please check if the extension is available or install it. Please note, it is necessary to reload the page after installing MetaMask.",
    "descKeeperWallet": "Unfortunately, we were unable to find the Keeper Wallet extension installed on this browser. Please check if the extension is available or install it."
  },
  "install": "Install",
  "approveConnection": {
    "title": "Approve Connection",
    "desc": "Approve the connection and grant access to rideonwaves.io on your {{device}} wallet to continue."
  },
  "switchWithParameters": {
    "title": "Add {{network}} Network Parameters and Switch to it",
    "desc": "To continue using our services please add {{network}} network parameters and switch to it on your {{device}} wallet."
  },
  "unsupportedAccount": {
    "title": "Unsupported Account",
    "desc": "Unfortunately, at this moment we do not support MetaMask's public keys starting with the zero byte. Please retry with another MetaMask account or use another log in method."
  },
  "retry": "Retry",
  "requestHasNotConfirmed": {
    "title": "The Request Has Not Been Confirmed",
    "desc": "You did not confirm the request using {{device}}."
  },
  "legalDisclaimer": {
    "title": "Legal Disclaimer",
    "desc": "I understand and accept that staking is a risky process. Crypto can be highly volatile, there is a risk that the market price could be significantly higher or lower by the time the unstaking process is complete. No guarantee of rewards/profits. I am the only owner of my assets and it is my responsibility to keep my data, particularly, the seed phrase, safe. I understand and accept the risk of possible attacks on the protocol that can be resulted in loss of my assets."
  },
  "havenotfee": "You don't have enough funds to pay the Transaction Fee.",
  "tryAgain": "Try Again",
  "waitingConfirmation": "Waiting for confirmation from {{device}}",
  "waiting": "Waiting",
  "rejectedByUserDevice": "You did not confirm the request using {{device}}.",
  "rejectedByUser": "You did not confirm the request.",
  "wrongNetworkError": "Wrong network is selected in the {{device}}. Choose the proper network and try again.",
  "wrongUser": "Wrong account is selected in the {{device}}. Activate the proper account and try again.",
  "somethingWrongWithNode": "Something went wrong. Node error code: {{code}}.",
  "somethingWrong": "Something went wrong.",
  "availableToSwap": "Available for Swap",
  "youReceive": "You Receive",
  "swapAndStake": "Swap & Stake",
  "availableForClaim": "Available for Claiming",
  "accrued": "Accrued:",
  "claim": "Claim",
  "claimIsUnavailable": "Claim is currently unavailable as funds are staked. You will be able to claim funds with interest after the L2 network launch.",
  "totalStaking": "Total Staked",
  "totalStakingHelp": "Calculated as a sum of accrued funds that are currently in staking till the L2 network launch and your own staking contribution.",
  "stakingNode": "New Staking Node",
  "selectNode": "Select node",
  "totalStaked": "Total Staked",
  "totalStakedTooltip": "Calculated as a sum of accrued funds and your own staking contribution. You will be able to unstake funds after the L2 network launch.",
  "kpiPeriodEnds": "KPI period ends in",
  "claimUnavailable": "Claim is currently unavailable. You will be able to claim funds after the L2 network launch.",
  "availableForStakingHelp": "Calculated as a sum of available balance on your account and unclaimed funds.",
  "getL2MP": "Get L2MP",
  "responsibilitiesWarning": "rideonwaves.io is not responsible for rewards payout. The rewards payout process, its frequency and percentage are determined by the nodes.",
  "goToWavescap": "Go to the list of staking nodes (wavescap.com)",
  "enterManually": "Enter manually",
  "enterManuallyDesc": "Enter the node address manually",
  "EnterNodeAddress": "Enter Node Address"
}
